{
  "backend/main.mo": "Minimal Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report listing implemented UI asset additions, category updates, and gallery sections with associated files and confidence ratings.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend components, pages, and content modules.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, dark mode overrides, and global border/background styles.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component handling routing via a custom router and rendering Header, Footer, and current page.",
  "frontend/src/branding/theme.ts": "Brand configuration exporting name, logo path, and teal/green OKLCH color palette.",
  "frontend/src/components/CategoryCard.tsx": "UI card component that displays a category photo, icon with fallback, title, and description with hover effects and error handling.",
  "frontend/src/components/ContactDetails.tsx": "Component rendering phone, email, and address in compact or detailed layouts using shared contact data.",
  "frontend/src/components/Footer.tsx": "Footer with brand info, quick navigation, compact contact details, and attribution link with tracking.",
  "frontend/src/components/Header.tsx": "Responsive header with scroll‑based styling, navigation links, mobile menu, and router-based navigation.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, headline, and buttons for contact navigation and phone call.",
  "frontend/src/components/ImageGallery.tsx": "Responsive image grid that hides images failing to load using error tracking state.",
  "frontend/src/components/Logo.tsx": "Displays the brand logo with fallback rendering if the image fails to load.",
  "frontend/src/components/Section.tsx": "Wrapper component providing a padded section with container layout.",
  "frontend/src/content/categories.ts": "Defines product categories with metadata including icons, photos, and descriptions.",
  "frontend/src/content/contact.ts": "Static contact information object containing phone, email, and address.",
  "frontend/src/content/icuSetup.ts": "Lists ICU setup requirement groups with detailed equipment, furniture, and construction items.",
  "frontend/src/content/otSetup.ts": "Provides a list of basic OT setup requirement items.",
  "frontend/src/content/productGalleries.ts": "Exports image galleries for hospital furniture and laboratory setups.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables for light/dark themes and typography styling.",
  "frontend/src/lib/router.ts": "Simple client-side router using the History API with subscription-based route change notifications.",
  "frontend/src/main.tsx": "App entry point mounting React with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "About page describing the company’s services, quality focus, and expertise with icon sections.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with a header and detailed contact information inside a styled Section component.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage containing only the Hero component.",
  "frontend/src/pages/ProductsPage.tsx": "Shows product categories, ICU and OT setup requirement lists, and product galleries using multiple Section components and mapped content arrays.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Describes the project’s state, requirements, issues, and needed assets for building the multi‑page Predicta Healthcare website."
}