{
  "backend/main.mo": "Minimal Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base and utility layers plus CSS variables defining light and dark theme color tokens.",
  "frontend/index.html": "Root HTML file mounting the app and loading the main TypeScript entry module.",
  "frontend/src/App.tsx": "Main app component handling routing, rendering pages, and including header and footer.",
  "frontend/src/branding/theme.ts": "Brand configuration exporting site name, logo path, and healthcare‑themed color palette.",
  "frontend/src/components/CategoryCard.tsx": "Category card UI with optional photo, icon fallback handling, and hover animations.",
  "frontend/src/components/ContactDetails.tsx": "Renders phone, email, and address details in compact or detailed variants.",
  "frontend/src/components/Footer.tsx": "Footer with logo, quick links, contact info, and attribution section.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, navigation links, scroll effects, and mobile menu.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, headline, and call-to-action buttons including navigation to contact and phone link.",
  "frontend/src/components/ImageGallery.tsx": "Responsive image grid that hides images failing to load using local error tracking.",
  "frontend/src/components/Logo.tsx": "Displays brand logo with fallback initials and name if the logo image fails.",
  "frontend/src/components/Section.tsx": "Wrapper component that renders a padded section with container styling.",
  "frontend/src/content/categories.ts": "Defines category objects for ICU, OT, furniture, and lab setups with descriptions and image metadata.",
  "frontend/src/content/contact.ts": "Exports basic contact information including phone, email, and address.",
  "frontend/src/content/icuSetup.ts": "Lists grouped ICU setup requirements across equipment, furniture, and construction.",
  "frontend/src/content/otSetup.ts": "Lists basic OT setup requirement items.",
  "frontend/src/content/productGalleries.ts": "Exports gallery image arrays for hospital furniture and laboratory setups.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, logout, and identity loading logic.",
  "frontend/src/index.css": "Tailwind base styles and custom color variables for light and dark themes with typography enhancements.",
  "frontend/src/lib/router.ts": "Implements a simple history-based router with navigation, subscriptions, and scroll restoration.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the root app.",
  "frontend/src/pages/AboutPage.tsx": "About page section describing the company with feature blocks and overview text.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact section with a title, description, and detailed contact info component.",
  "frontend/src/pages/HomePage.tsx": "Simple page that displays the Hero component.",
  "frontend/src/pages/ProductsPage.tsx": "Displays product categories and detailed sections for ICU setup, OT setup, and galleries using various content sources and components.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing goals, requirements, known issues, and existing features for the Predicta Healthcare website."
}